example-files/Request.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <GetCourseDetailsRequest xmlns="http://java-soap.com/courses">
            <id>1</id>
        </GetCourseDetailsRequest>
    </Body>
</Envelope>